app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "completed_at") VALUES (?, ?, ?, ?, ?)  [["content", "yoloss"], ["todo_list_id", 1], ["created_at", "2022-07-04 18:36:16.133043"], ["updated_at", "2022-07-04 18:36:16.133043"], ["completed_at", nil]]

  def complete
    @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_items"."id" = ?  [["updated_at", "2022-07-04 18:46:33.270747"], ["completed_at", "2022-07-04 18:46:33.270186"], ["id", 5]]

  def incomplete
    @todo_item.update_attribute(:completed_at, nil)
---
UPDATE "todo_items" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_items"."id" = ?  [["updated_at", "2022-07-05 03:59:31.146211"], ["completed_at", nil], ["id", 25]]